Revit 2026 API

# ImageExportOptionsFitDirection Property

---

The fit direction. Used only if ZoomType is FitToPage.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FitDirectionType FitDirection { get; set; }
```
```vb
Public Property FitDirection As FitDirectionType
	Get
	Set
```
```cpp
public:
property FitDirectionType FitDirection {
	FitDirectionType get ();
	void set (FitDirectionType value);
}
```
```fsharp
member FitDirection : FitDirectionType with get, set
```

#### Property Value

FitDirectionType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default is Horizontal.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace